//Задача 6
Console.Clear();
Console.WriteLine("Введите число: ");
int n=Convert.ToInt32(Console.ReadLine());

if (n % 2 != 0)
        Console.WriteLine("неЧетное");
else 
        Console.WriteLine("Четное");